{
  "header" : {
    "day-seoul" : "DAY IN SEOUL",
    "night-seoul" : "NIGHT IN SEOUL",
    "amenities" : "Amenities",
    "danger-area" : "Danger Area",
    "food-map" : "Food Map",
    "delivery" : "Delivery",
    "traffic" : "Traffic",
    "directions" : "Directions",
    "public-transportation" : "Public Transportation",
    "Ddareungi" : "Ddareungi(Bicycle Rental)",
    "help": "HELP",
    "exchangeRate": "Exchange Rate",
    "language-settings": "LANGUAGE SETTINGS",
    "search": "SEARCH",
    "adminPage": "Admin Page",
    "myReviews": "My Reviews",
    "updateProfile": "Update Profile",
    "logout": "Logout"
  },
  "home" : {
    "day" : "DAY",
    "night" : "NIGHT",
    "event" : "Event",
    "performance" : "Performance", 
    "recommended-restaurants" : "Recommended Restaurants",
    "recommended-accommodation": "Recommended Accommodation"
  },
  "Ddareungi-page" : {
    "bicycle-rental-location" :"Bicycle Rental Location",
    "title": "How to Use Ddareungi",
    "steps1": "1. Arrive at the rental station and choose a bicycle.",
    "steps2": "2. To rent a bicycle, open the 'Ddareungi' app on your smartphone.",
    "steps3": "3. Scan the QR code in the app to rent the bicycle.",
    "steps4": "4. After using the bicycle, return it to a nearby rental station.",
    "steps5": "5. If there are no bicycles at the rental station, check other stations or go to a location where bikes are available.",
    "go-to-website": "Go to Ddareungi Website",
    "download-android": "Download Ddareungi App (Android)",
    "download-ios": "Download Ddareungi App (iOS)"
  },
  "loading" : "Loading...",
  "weather": {
    "current-temp": "Current Temperature",
    "max-temp": "Max Temperature",
    "min-temp": "Min Temperature"
  },
  "seoulDay-page": {
    "tourist-spots": "#Tourist Spots",
    "cultural-facilities": "#Cultural Facilities",
    "restaurants": "#Restaurants",
    "accommodation": "#Accommodation",
    "shopping": "#Shopping",
    "leisure": "#Leisure"
  },
  "seoulNight-page": {
    "hotBars": "#Hot Bars",
    "quietBars": "#Quiet Bars",
    "maidButlerCafe": "#Maid/Butler Cafe",
    "pickUpSpots": "#Pick-up Spots",
    "pickUpTargets": "#Pick-up Targets",
    "club": "#Club"
  },
  "top5":"TOP5",
  "exchange": {
    "title": "Currency Exchange",
    "kor": "South Korea",
    "us": "United States",
    "eu": "European Union",
    "cn": "China",
    "jp": "Japan",
    "kor-curr": "Won",
    "us-curr": "Dollar",
    "eu-curr": "Euro",
    "cn-curr": "Yuan",
    "jp-curr": "Yen",
    "placeholder": "Enter a number"
  },
  "plus": {
    "title": "Things Needed for Visa Application",
    "passfort": "Passport",
    "passfort-text": "Your passport must be valid for at least 6 months beyond the visa application date.",
    "visa": "Visa Application Form",
    "visa-text": "Fill out the visa application form provided by the Korean embassy or consulate.",
    "picture": "Passport Photo",
    "picture-text": "Generally, a passport photo taken within the last 6 months is required.",
    "reserve": "Flight Reservation Proof",
    "reserve-text": "A flight reservation or booking details showing your entry and exit dates to/from Korea.",
    "motel": "Accommodation Reservation Proof",
    "motel-text": "Hotel reservation details or an invitation letter and the inviter's ID copy if you are invited by family/friends residing in Korea.",
    "finance": "Financial Proof",
    "finance-text": "Bank statement, salary slip, or other proof that you can cover your travel expenses.",
    "document": "Other Documents",
    "document-text": "Additional documents may be required depending on the purpose of your travel (e.g., invitation letter for family visit)."
  },
  "information" : {
    "a": "#Visa",
    "b": "#Language",
    "c": "#Transportation",
    "d": "#Seasons",
    "e": "#Safety and Security",
    "f": "#Currency Exchange and Cards",
    "g": "#Norms and Laws",
    "top-title-1": "South Korea is a very convenient country to visit. Knowing basic information before starting your trip will make your experience more enjoyable.",
    "top-title-2": "Make use of various transportation options, medical facilities, and a safe environment to experience the many charms of South Korea!",
    "top-title-3": "Here are some basic information you need for your trip to South Korea.",
    "middle-title-1": "Visa",
    "begin-1": "To travel to South Korea, you will need to obtain entry permission in the form of a visa. Some countries are offered visa exemptions.",
    "title-1-1": "1. Types of Visas",
    "title-text-1-1-1": "- Tourist Visa (C-3): The most common type of tourist visa, allowing a stay of up to 90 days in South Korea.",
    "title-1-2": "2. Visa Application Eligibility",
    "title-text-1-2-1": "2.1 You must have a legitimate purpose for visiting South Korea, such as tourism or family visits.",
    "title-text-1-2-2": "2.2 You must plan to stay for a specified period (usually 90 days or less).",
    "title-text-1-2-3": "2.3 The applicant must be financially self-sufficient and have an intention to return to their home country.",
    "title-1-3": "3. Visa Application Process",
    "title-text-1-3-1": "3.1 Submit the visa application form and documents to the South Korean embassy or consulate. Some embassies may offer online visa applications, so it's good to check the website of the South Korean embassy in your country.",
    "title-text-1-3-2": "3.2 Pay the visa application fee. The fee varies by visa type and nationality, and payment can typically be made by cash or card.",
    "title-text-1-3-3": "3.3 Visa Review The embassy will review your documents and notify you of the result. The review process typically takes 3-5 days, and additional documents or an interview may be requested.",
    "title-text-1-3-4": "3.4 Visa Issuance Once your visa is approved, it will be affixed to your passport. You can pick up your visa from the embassy or consulate.",
    "title-1-4": "4. Visa Exemption Countries",
    "title-text-1-4-1": "South Korea offers visa exemptions to certain countries. For example, visitors from Japan, the United States, and European Union (EU) countries may not need a visa or may receive a visa upon arrival for short-term tourism. You can check the list of visa-exempt countries on the South Korean Ministry of Foreign Affairs website, as there may be specific regulations depending on the purpose of visit and stay duration.",
    "title-1-5": "5. Visa Extension",
    "title-text-1-5-1": "If you want to extend your stay in South Korea after entering, you can apply for an extension at the immigration office. However, tourist visas typically have limitations on extensions (usually up to 90 days), so it's advisable to check in advance whether an extension is possible. If extension is not allowed, you may need to apply for a new visa after leaving the country.",
    "title-1-6": "6. Other Important Notes",
    "title-text-1-6-1": "Passport Validity",
    "title-text-1-6-2": "Your passport must be valid for at least 6 months from the date of visa application.",
    "title-text-1-6-3": "Possible Visa Denial",
    "title-text-1-6-4": "If there is any false information in the application or documents, your visa may be denied. Additionally, if you have a record of illegal stay in South Korea, your visa may be rejected.",
    "middle-title-2": "Language",
    "begin-2": "The official language of South Korea is Korean, which uses its own script, Hangul. Most Koreans use Korean as their primary language.",
    "title-2-1": "1. Response Expressions",
    "title-text-2-1-1": "네 (Ne): Yes",
    "title-text-2-1-2": "아니요 (Aniyo): No",
    "title-text-2-1-3": "알아요 (Arayo): I know",
    "title-text-2-1-4": "몰라요 (Mollayo): I don't know",
    "title-text-2-1-5": "괜찮아요 (Gwaenchana-yo): It's okay / I'm fine",
    "title-2-2": "2. Gratitude and Apology",
    "title-text-2-2-1": "감사합니다 (Gamsahamnida): Thank you (formal)",
    "title-text-2-2-2": "고마워요 (Gomawoyo): Thank you (casual)",
    "title-text-2-2-3": "미안합니다 (Mianhamnida): I'm sorry (formal)",
    "title-text-2-2-4": "미안해요 (Mianhaeyo): I'm sorry (casual)",
    "title-text-2-2-5": "괜찮아요 (Gwaenchana-yo): It's okay / I'm fine",
    "title-2-3": "3. Greetings",
    "title-text-2-3-1": "안녕하세요 (Annyeonghaseyo): Hello (polite and common greeting)",
    "title-text-2-3-2": "안녕 (Annyeong): Hi / Bye (to close friends)",
    "title-text-2-3-3": "좋은 아침이에요 (Joeun achim-ieyo): Good morning",
    "title-text-2-3-4": "안녕히 가세요 (Annyeonghi gaseyo): Goodbye (when the other person is leaving)",
    "title-text-2-3-5": "안녕히 계세요 (Annyeonghi gyeseyo): Goodbye (when you are leaving)",
    "title-2-4": "4. Questions",
    "title-text-2-4-1": "이게 뭐에요? (Ige mwoeyo?): What is this?",
    "title-text-2-4-2": "어디에요? (Eodieyo?): Where is it?",
    "title-text-2-4-3": "몇 시에요? (Myeot sieyo?): What time is it?",
    "title-text-2-4-4": "얼마에요? (Eolmaeyo?): How much is it?",
    "title-text-2-4-5": "왜요? (Waeyo?): Why?",
    "title-text-2-4-6": "어떻게 가요? (Eotteoke gayo?): How do I get there?",
    "title-2-5": "5. Asking for Directions",
    "title-text-2-5-1": "이 길 맞아요? (I gil majayo?): Is this the right way?",
    "title-text-2-5-2": "왼쪽으로 가세요 (Oenjjog-euro gaseyo): Go left",
    "title-text-2-5-3": "오른쪽으로 가세요 (Oreunjjog-euro gaseyo): Go right",
    "title-text-2-5-4": "직진하세요 (Jikjin haseyo): Go straight",
    "title-2-6": "6. Other",
    "title-text-2-6-1": "이해해요 (Ihaehaeyo): I understand",
    "title-text-2-6-2": "다시 한 번 말해 주세요 (Dashi han beon malhae juseyo): Please say it again",
    "title-text-2-6-3": "천천히 말해 주세요 (Cheoncheonhi malhae juseyo): Please speak slowly",
    "title-text-2-6-4": "영어 할 수 있어요? (Yeongeo hal su isseoyo?): Can you speak English?",
    "title-text-2-6-5": "도와줄 수 있나요? (Dowajul su innayo?): Can you help me?",
    "middle-title-3": "Transportation",
    "begin-3": "Korea has a well-developed transportation system, with various modes of transportation operating efficiently.",
    "title-3-1": "1. Subway Tips",
    "title-text-3-1-1": "Subway Fare",
    "title-text-3-1-2": ": The basic fare is 1,500 KRW, and for every 10 km, an additional 100 KRW is added per km.",
    "title-text-3-1-3": "Subway Map",
    "title-text-3-1-4": ": Seoul subway has lines from Line 1 to Line 9, each of which is distinguished by different colors, making it easy to follow. Most stations provide information in English, so you can check information in English at major stations.",
    "title-text-3-1-5": "At the Station",
    "title-text-3-1-6": ": When transferring, make sure to check the exit signs. Transfers are discounted, so it's a good idea to check transfer information beforehand. Be careful not to lose your subway ticket.",
    "title-text-3-1-7": "If you use a card, you can use it without worrying, but if you use cash, you may be charged additional fees if you lose your ticket.",
    "title-text-3-1-8": "Rush Hour",
    "title-text-3-1-9": ": Seoul subway is very crowded during rush hours (7-9 AM, 6-8 PM). It's a good idea to plan for extra time during these periods.",
    "title-3-2": "2. Bus Tips",
    "title-text-3-2-1": "Bus Routes",
    "title-text-3-2-2": ": In most major cities, buses are classified by blue, green, and red buses.",
    "title-text-3-2-3": "Blue buses connect subway stations with other districts.",
    "title-text-3-2-4": "Green buses circulate within neighborhoods.",
    "title-text-3-2-5": "Red buses are premium buses that connect subway stations with highways.",
    "title-text-3-2-6": "Bus Stops",
    "title-text-3-2-7": ": Most bus stops are also labeled in English, making it easy to find a bus that will take you to your destination, even if you want to avoid traffic.",
    "title-text-3-2-8": "Transportation Card",
    "title-text-3-2-9": ": When boarding the bus, swipe your card at the card reader, and swipe it again when getting off. You cannot pay with cash on the bus, so make sure you have a transportation card.",
    "title-3-3": "3. Taxi Tips",
    "title-text-3-3-1": "1. How to Ride a Taxi",
    "title-text-3-3-2": "Regular Taxi",
    "title-text-3-3-3": ": You can hail a taxi by waving your hand on the street.",
    "title-text-3-3-4": "Taxi Booking App",
    "title-text-3-3-5": ": You can call a taxi via smartphone apps (e.g., KakaoT, T-map, etc.).",
    "title-text-3-3-6": "Taxi Stands",
    "title-text-3-3-7": ": There are designated taxi stands at airports, train stations, and bus terminals, so you can wait at those places or use taxis from the stands.",
    "title-text-3-3-8": "2. Basic Fare and Fare System",
    "title-text-3-3-9": "The basic fare varies by region, but in Seoul, it is 4,800 KRW.",
    "title-text-3-3-10": "Distance and time charges are calculated automatically by the taxi meter.",
    "title-text-3-3-11": "Night-time Surcharge: There is an additional 20% charge on the basic fare for rides between midnight and 4 AM.",
    "middle-title-4": "Seasons",
    "begin-4": "Korea has four distinct seasons, and the weather and travel environment change greatly with each season.",
    "title-4-1": "1. Spring (March to May)",
    "title-text-4-1-1": "Spring is one of the most beautiful seasons in Korea, with flowers blooming and the weather being very pleasant. However, there are some things to be cautious about.",
    "title-text-4-1-2": "Main Tips:",
    "title-text-4-1-3": "Cherry Blossom Season (Late March to Early April)",
    "title-text-4-1-4": "- During the cherry blossom season, many people participate in cherry blossom festivals or visit cherry blossom spots.",
    "title-text-4-1-5": "Popular cherry blossom spots include Yeouido Han River Park in Seoul, Jinhae, and Gyeongju.",
    "title-text-4-1-6": "- Be mindful of fine dust during cherry blossom viewing, so it's a good idea to bring a mask or glasses.",
    "title-text-4-1-7": "Weather:",
    "title-text-4-1-8": "The weather is mild, but there can be a large temperature difference between morning and evening, so it's advisable to bring light outerwear and a sweater. A light jacket is also useful if it's windy.",
    "title-text-4-1-9": "Caution:",
    "title-text-4-1-10": "- Fine Dust: Spring often has high levels of fine dust. On cloudy or dusty days, wearing a mask is recommended.",
    "title-text-4-1-11": "- Allergies: Allergy symptoms may occur due to pollen or substances released by trees. You can buy antihistamines at pharmacies, so it's good to prepare in advance.",
    "title-4-2": "2. Summer (June to August)",
    "title-text-4-2-1": "Summer is characterized by hot and humid weather, with possible monsoons and typhoons.",
    "title-text-4-2-2": "Main Tips:",
    "title-text-4-2-3": "Monsoon Season (Late June to Early July)",
    "title-text-4-2-4": "- It rains frequently during this period, so you must bring an umbrella. It's a good idea to bring a light raincoat or a portable umbrella.",
    "title-text-4-2-5": "- During summer, you may need to spend more time indoors, so consider visiting indoor tourist attractions like museums or art galleries.",
    "title-text-4-2-6": "Summer Vacation:",
    "title-text-4-2-7": "- Many travelers visit beaches or valleys in the summer. You can enjoy the summer sea by taking a train or bus from Seoul to places like Gangneung, Sokcho, or Jeju Island.",
    "title-text-4-2-8": "Weather:",
    "title-text-4-2-9": "The weather is hot and humid, so it's advisable to bring light clothing, a hat, and sunscreen.",
    "title-text-4-2-10": "Caution:",
    "title-text-4-2-11": "- Humidity and Heat: Summer is extremely hot and humid, so it's essential to stay hydrated. Drink plenty of water and ensure sun protection with a hat and sunscreen.",
    "title-text-4-2-12": "- Typhoons: Typhoons may occur around August. If you expect a typhoon during your travels, check weather forecasts and avoid going outside.",
    "title-4-3": "3. Fall (September to November)",
    "title-text-4-3-1": "Fall is one of the best seasons to travel in Korea, with cool weather and beautiful scenery.",
    "title-text-4-3-2": "Main Tips:",
    "title-text-4-3-3": "Autumn Foliage Season (Mid October to Early November)",
    "title-text-4-3-4": "- Fall is the peak season for autumn leaves, and you can see beautiful foliage in mountains like Seoraksan, Bukhansan, and Jirisan.",
    "title-text-4-3-5": "- Enjoying autumn leaves is a great time for walks or hikes, so be sure to wear comfortable shoes.",
    "title-text-4-3-6": "Weather:",
    "title-text-4-3-7": "The heat of summer is gone, and the temperature is cool, so it's a good idea to bring light outerwear or a jacket.",
    "title-text-4-3-8": "Caution:",
    "title-text-4-3-9": "- Temperature Difference: Fall has a large temperature gap between day and night, so bring light clothing along with warm layers. A jacket or cardigan is recommended.",
    "title-text-4-3-10": "- Fine Dust: Fine dust may still occur in fall, so it's advisable to bring a mask.",
    "title-4-4": "4. Winter (December to February)",
    "title-text-4-4-1": "Winter is very cold, with frequent snow, offering the chance to enjoy snow-covered landscapes, but you should be prepared for the cold and snow.",
    "title-text-4-4-2": "Main Tips:",
    "title-text-4-4-3": "Winter Sports:",
    "title-text-4-4-4": "- Many people travel to regions like Pyeongchang, Yongpyong, and Phoenix Park in Gangwon-do to enjoy winter sports like skiing and snowboarding. It's a good idea to make reservations in advance if you plan to enjoy winter sports.",
    "title-text-4-4-5": "- Hot springs and spas are also popular winter destinations. You can enjoy hot springs in areas near Seoul during the winter.",
    "title-text-4-4-6": "Weather:",
    "title-text-4-4-7": "Winter is very cold, so bring thick winter clothing, gloves, and scarves. If you're going to areas with heavy snow, it's a good idea to prepare waterproof clothes and shoes.",
    "title-text-4-4-8": "Caution:",
    "title-text-4-4-9": "- Cold: Winter can be extremely cold, so pack warm clothing. Hot packs and gloves can make your trip more comfortable.",
    "title-text-4-4-10": "- Snow and Icy Roads: Snow can create icy roads, making them slippery. It's important to wear shoes that prevent slipping. On snowy days, it's safer to stay indoors.",
    "reference-1": "Additional Common Tips",
    "reference-1-1": "- Check the weather forecast: The weather in Korea can change rapidly, so it's important to check weather forecasts frequently.",
    "reference-1-2": "- Bring necessary medicines: Depending on the season, it's a good idea to bring allergy medication or winter accessories. In winter, it's also helpful to bring moisturizing products.",
    "reference-1-3": "- Prepare for outings: When going out, make sure to bring items like an umbrella or portable battery to deal with weather or any inconvenience.",
    "middle-title-5": "Safety and Security",
  "begin-5-1": "South Korea is one of the safest countries in the world, with a very low crime rate.",
  "begin-5-2": "However, it is important to follow basic safety rules, manage your belongings while going out, and pay attention to traffic safety.",
  "title-5-1": "1. Emergency Contact Information",
  "title-text-5-1-1": "Emergency Contacts:",
  "title-text-5-1-2": "Police: 112 (Available in Korean and English)",
  "title-text-5-1-3": "Fire and Ambulance: 119 (Quick response in emergencies)",
  "title-text-5-1-4": "Korea Tourism Organization 1330: Emergency support service for foreigners, available in multiple languages (English, Chinese, Japanese, etc.)",
  "title-text-5-1-5": "It is useful to check the locations of nearby police stations and hospitals in advance.",
  "title-5-2": "2. Lost Property Management",
  "title-text-5-2-1": "Reporting Losses:",
  "title-text-5-2-2": "If you lose your passport or wallet in Korea, you can report it to the nearest police station or passport loss reporting center for assistance.",
  "title-text-5-2-3": "Lost Passport:",
  "title-text-5-2-4": "After reporting the lost passport, contact the embassy to obtain a new one.",
  "title-text-5-2-5": "Lost and Found Centers:",
  "title-text-5-2-6": "Major stations, airports, and large shopping malls have lost and found centers where you can inquire about the location of your lost items.",
  "title-5-3": "3. Natural Disasters and Weather Conditions",
  "title-text-5-3-1": "Typhoons and Monsoon Season:",
  "title-text-5-3-2": "During the summer, typhoons or the monsoon season may occur. If the weather worsens, it is advisable to avoid going out and stay safely indoors.",
  "title-text-5-3-3": "Snow and Ice-covered Roads:",
  "title-text-5-3-4": "In winter, snow may fall. Be cautious of slippery roads and prepare anti-slip shoes, or carry hand warmers to keep warm.",
  "reference-2": "Useful Tips",
  "reference-2-1": "Travel Insurance:",
  "reference-2-2": "It is advisable to purchase travel insurance to cover unexpected accidents or illnesses. It is useful to choose an insurance plan that covers medical expenses and cancellation fees.",
  "reference-2-3": "First Aid Kit Preparation:",
  "reference-2-4": "Carrying a basic first aid kit (bandages, antiseptics, painkillers, etc.) can be useful.",
  "reference-2-5": "Language Issues:",
  "reference-2-6": "Since Korean may be difficult, it is helpful to learn basic English expressions or use Google Translate to facilitate communication.",
  "middle-title-6": "Currency Exchange and Card Use",
  "begin-6": "In South Korea, both currency exchange and card use are convenient, but there are some things to keep in mind.",
  "title-6-1": "1. Currency Exchange",
  "title-text-6-1-1": "Where to Exchange Currency:",
  "title-text-6-1-2": "Airports: Major international airports in Korea (Incheon, Gimpo, etc.) have currency exchange booths. However, the exchange rate at airport booths may be less favorable, so it's better to exchange only small amounts at the airport and exchange the rest in the city.",
  "title-text-6-1-3": "Banks: You can exchange foreign currency at banks in Seoul and other major cities. A passport is required, and exchanges are only available during business hours, so it's a good idea to check ahead.",
  "title-text-6-1-4": "Currency Exchange Offices: Exchange offices in the city often have better rates and lower fees.",
  "title-text-6-1-5": "Things to Keep in Mind When Exchanging Currency:",
  "title-text-6-1-6": "Exchange Rates and Fees: Exchange rates may vary depending on the time and location. City exchange offices or banks may offer more favorable rates than at the airport, so it’s good to compare multiple places.",
  "title-text-6-1-7": "Cash Limit: If you bring over $10,000 into Korea, you must declare it. The same regulation applies when exchanging money in Korea.",
  "title-6-2": "2. Card Use",
  "title-text-6-2-1": "Card Acceptance",
  "title-text-6-2-2": "Major international card brands such as Visa, MasterCard, JCB, and American Express are accepted at most merchants.",
  "title-text-6-2-3": "However, some small shops or traditional markets may only accept cash, so card use might be inconvenient in such places.",
  "title-text-6-2-4": "Things to Keep in Mind When Using Cards",
  "title-text-6-2-5": "Card Authorization Countries: It is important to confirm whether your card is eligible for use abroad. When attempting to make a payment online or at ATMs, your card might be declined, so check with your card issuer about overseas usage settings.",
  "title-text-6-2-6": "Card Fees: International card payments may incur fees. For example, your card issuer may charge a foreign transaction fee.",
  "title-text-6-2-7": "Using Credit Cards: When using a credit card, the payment will be made on a deferred basis, unlike cash payments that are immediate. It is recommended to set a monthly limit or enable notifications for overseas transactions when using a credit card.",
  "reference-3": "Reference",
  "reference-3-1": "Tipping is not a custom in South Korea.",
  "middle-title-7": "Norms and Laws",
  "begin-7": "Korea traditionally values manners and norms highly, and as such, social behavior and laws are established in specific ways.",
  "title-7-1": "1. Honorifics and Etiquette",
  "title-text-7-1-1": "Use of Honorifics",
  "title-text-7-1-2": ": In Korea, it is important to use appropriate honorifics based on age, rank, and social status. For example, one must use honorifics when speaking to elders or superiors in the workplace. Failing to do so can be seen as disrespectful, and using informal language when not appropriate can cause discomfort.",
  "title-text-7-1-3": "Respect for Elders",
  "title-text-7-1-4": ": Showing respect to elders is an important norm in Korean society. For instance, it is common to wait for an elder to start eating before beginning a meal.",
  "title-7-2": "2. Drinking Culture and Etiquette",
  "title-text-7-2-1": "Drinking Etiquette",
  "title-text-7-2-2": ": In Korea, drinking occasions are considered important social events, and there are etiquette rules even for pouring drinks. Typically, older individuals pour drinks for younger people, and when a younger person serves an elder, the younger person should hold the glass with both hands.",
  "title-text-7-2-3": "Behavior at Drinking Gatherings",
  "title-text-7-2-4": ": When drinking, it is polite to turn your head away while drinking. It is also inappropriate to force someone to drink if they no longer wish to.",
  "title-7-3": "3. Legal Regulations and Social Restrictions",
  "title-text-7-3-1": "Smoking and Non-Smoking Areas",
  "title-text-7-3-2": ": Smoking is strictly regulated in public spaces in Korea, and it is illegal to smoke in designated non-smoking areas. Smoking on the streets or in public areas can cause discomfort to others, so it is important to be mindful of this.",
  "title-text-7-3-3": "Drunk Driving",
  "title-text-7-3-4": ": Drunk driving is considered a very serious crime in Korea. A blood alcohol level of 0.03% or higher is considered drunk driving, and refusal to take a breathalyzer test may result in more severe penalties, including license suspension or imprisonment.",
  "title-7-4": "4. Time and Appointments",
  "title-text-7-4-1": "Punctuality",
  "title-text-7-4-2": ": Koreans place great importance on time. Being late or failing to keep an appointment is considered a serious breach of etiquette and may cause a loss of trust, even if the other party is late.",
  "title-text-7-4-3": "Changing Appointments",
  "title-text-7-4-4": ": Suddenly changing or canceling appointments can also be perceived negatively in Korea. Especially in the workplace, changing appointments can affect the credibility of work commitments.",
  "title-7-5": "5. Traffic Regulations",
  "title-text-7-5-1": "Illegal Parking",
  "title-text-7-5-2": ": Illegal parking is strictly regulated in Korea, and fines can be imposed. Illegal parking on the street is frequent and disrupts traffic flow, so the police often enforce regulations.",
  "title-text-7-5-3": "Pedestrian Crossing Zones",
  "title-text-7-5-4": ": In pedestrian crossing zones, vehicles must yield to pedestrians. Ignoring this and passing when a pedestrian is crossing can lead to penalties for violating traffic laws.",
  "title-7-6": "6. Traditional Customs and Etiquette",
  "title-text-7-6-1": "Holidays and Gifts",
  "title-text-7-6-2": ": In Korea, exchanging gifts during holidays and significant events is an important cultural practice. Especially during the Lunar New Year and Chuseok, giving gifts within families is common, and it is also typical to give gifts to senior colleagues.",
  "title-text-7-6-3": "Family-Centered Society",
  "title-text-7-6-4": ": Korea is traditionally a family-oriented society. For example, family roles are crucial during weddings and funerals, and attending such events is considered a social obligation.",
  "title-7-7": "7. Sexual Crimes and Behavior",
  "title-text-7-7-1": "Sexual Harassment and Crimes",
  "title-text-7-7-2": ": The legal regulations on sexual harassment and sexual crimes are very strict in Korea. If someone claims to have been harassed, the perpetrator can face legal penalties, which can also cause significant damage to their social image.",
  "title-text-7-7-3": "Sexual Expression and Image",
  "title-text-7-7-4": ": Publicly explicit sexual behavior is strongly opposed in Korea. It is important for foreigners to respect social norms and avoid overly sexual behavior in public places.",
  "title-7-8": "8. Other Laws and Social Norms",
  "title-text-7-8-1": "Illegal Downloading and Copyright",
  "title-text-7-8-2": ": Korea has strict copyright protection, and illegal downloading or streaming is punishable by law. These issues are actively monitored and enforced.",
  "title-text-7-8-3": "Foreign Registration Law",
  "title-text-7-8-4": ": Foreigners wishing to stay long-term in Korea must register with the government. Failure to do so may result in being considered an illegal resident. Foreigners must carry their foreign registration card to extend their stay or engage in employment.",
  "title-7-9": "9. Sensitive Topics",
  "title-text-7-9-1": "Political Statements and Actions",
  "title-text-7-9-2": ": In Korea, it is important to approach political issues cautiously. Making sensitive statements about historical events or political matters can lead to controversy.",
  "title-text-7-9-3": "National Duty",
  "title-text-7-9-4": ": Military service is a mandatory duty for South Korean men. Foreigners may show respect for men who have completed military service, as it is a significant cultural expectation.",
  "reference-4": "These social norms and laws reflect the unique cultural context of Korean society, and it is important for foreigners to be aware of and respect them."

  },
  "directions": {
    "title": "Directions",
    "currentLocation": "Current Location",
    "noCurrentLocation": "Unable to retrieve current location.",
    "destination": "Destination",
    "noDestination": "No destination information available.",
    "openNaverMap": "Open Naver Map App"
  },
  "amenities": {
    "convenience-store": "Convenience Store",
    "subway": "Subway Station",
    "coffee": "Cafe",
    "hospital": "Hospital",
    "pharmacy": "Pharmacy"
  },
  "underConstruction": {
    "title": "Under Construction",
    "message": "This page is under development. Please check back later."
  },
  "direction": "Directions",
  "login-page":{
    "login": "Login",
    "username": "Username",
    "password": "Password",
    "login_button": "Log in",
    "signup_button": "Sign up",
    "login_fail": "Login failed: Please check your username and password.",
    "server_error": "Server error: {{status}} - {{message}}",
    "network_error": "Could not connect to the server. Please check your network.",
    "request_error": "An error occurred during the login process. Please try again."
  },
  "signup":{
    "username": "Username",
    "password": "Password",
    "confirmPassword": "Confirm Password",
    "email": "Email",
    "verification": "Verification Code",
    "name": "Name",
    "tel": "Emergency Contact",
    "foreignYN": "Are you a foreigner?",
    "signup_button": "Sign Up",
    "email_verification_button": "Send Verification Code",
    "email_verification_in_progress": "Sending...",
    "verify_code_button": "Verify Code",
    "password_mismatch": "Passwords do not match.",
    "email_verification_pending": "Please complete email verification.",
    "email_verified": "Email verified successfully.",
    "verification_error": "Invalid verification code.",
    "server_error": "Server error: {{status}} - {{message}}",
    "network_error": "Unable to connect to the server. Please check your network.",
    "signup_error": "An error occurred during signup. Please try again."
  },
  "profile": {
    "username": "Username",
    "password": "New Password",
    "confirmPassword": "Confirm Password",
    "email": "Email",
    "name": "Name",
    "tel": "Emergency Contact",
    "foreignYN": "Are you a foreigner?",
    "updateButton": "Update Profile",
    "deleteButton": "Delete Account",
    "confirmModal": {
      "title": "Confirm",
      "message": "Are you sure you want to delete your account? \nYour account will be converted to a dormant state, and all your information will be deleted in 3 days.",
      "cancelButton": "Cancel",
      "confirmButton": "Confirm"
    }
  },
  "passwordCheck": {
    "login": "Login is required. Please log in to proceed.",
    "modalTitle": "Password Verification",
    "prompt": "Please enter your password.",
    "placeholder": "Password",
    "success": "Password verification successful!",
    "failure": "Verification failed.",
    "error": "An error occurred. Please try again.",
    "cancelButton": "Cancel",
    "confirmButton": "Confirm"
  },
  "logout": {
    "success": "You have been logged out."
  },
  "myreview":{
    "myReviewsTitle": "My Reviews",
    "noReviewsFound": "No reviews found.",
    "reviewDeleted": "Review has been deleted.",
    "deleteFailed": "Deletion failed: ",
    "loading": "Loading...",
    "error": "Error: ",
    "edit": "Edit",
    "delete": "Delete",
    "updated": "(Updated: {date})"
  }
  
}
